some addings
